 IDENTIFICATION DIVISION.
 PROGRAM-ID. ALTERNATEKEYWITHOUTRECORD.
 ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT TEACHER
       ASSIGN TO 'teacher.txt'
       ORGANIZATION IS INDEXED
       ACCESS MODE IS RANDOM
       RECORD KEY IS SOMEDATANAME
       ALTERNATE KEY IS SOMEDATANAME2
       FILE STATUS IS SOMEFILESTATUS.
