 IDENTIFICATION DIVISION.
 PROGRAM-ID. XMLGENERATESTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOMEXMLDOC PIC X(200).
 01 SOMEXMLLENGTH PIC 9(4) BINARY.
 01 SOMERECORD.
    05 SOMEFIELD PIC X(10).
 PROCEDURE DIVISION.
    XML GENERATE SOMEXMLDOC FROM SOMERECORD.
    XML GENERATE SOMEXMLDOC FROM SOMERECORD COUNT IN SOMEXMLLENGTH
        ON EXCEPTION MOVE 'A' TO SOMEFIELD
        NOT ON EXCEPTION MOVE 'B' TO SOMEFIELD
    END-XML.
