 IDENTIFICATION DIVISION.
 PROGRAM-ID. EXITPERFORMSTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOMECOUNTER PIC 9(4).
 PROCEDURE DIVISION.
    PERFORM UNTIL SOMECOUNTER > 10
        ADD 1 TO SOMECOUNTER
        EXIT PERFORM
    END-PERFORM.
    PERFORM UNTIL SOMECOUNTER > 20
        ADD 1 TO SOMECOUNTER
        EXIT PERFORM CYCLE
    END-PERFORM.
    EXIT PROGRAM.
