 IDENTIFICATION DIVISION.
 PROGRAM-ID. EXITPARASTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOMEFLAG PIC X.
 01 PARAGRAPH PIC X.
 PROCEDURE DIVISION.
 MAIN SECTION.
 P1.
     IF SOMEFLAG = 'A'
        EXIT PARAGRAPH
     END-IF.
     MOVE 'B' TO PARAGRAPH.
 P2.
     EXIT SECTION.
