CBL CICS('COBOL3,SP') APOST                                             12345678
      CBL XOPTS('EXCI,COBOL3')                                          12345678
000100 IDENTIFICATION DIVISION.                                         12345678
000100 PROGRAM-ID. CblNoSequenceArea.                                   12345678
000100 PROCEDURE DIVISION.                                              12345678
000100     DISPLAY 'X'.                                                 12345678
