000100* SECURITY TAG DETAILS                                            12345678
000100* *********************                                           12345678
000100 01  SOME-RECORD.                                                 12345678
000100     05  SOME-FIELD          PIC X(10).                           12345678
