000100 IDENTIFICATION DIVISION.                                         12345678
000100 PROGRAM-ID. CommentEntryParagraphNoDot.                          12345678
000100 AUTHOR         SOMEAUTH                                          12345678
000100 INSTALLATION   SOMEINSTALL                                       12345678
000100 DATE-WRITTEN   17-AUG-2005.                                      12345678
000100 DATE-COMPILED  02/07/2002.                                       12345678
000100 SECURITY     : NONE                                              12345678
000100 REMARKS        SOMEREM.                                          12345678
000100 PROCEDURE DIVISION.                                              12345678
000100   EXEC CICS QUERY                                                12345678
000100             SECURITY RESTYPE(WS-RES) RESID(WS-ID)                12345678
000100   END-EXEC.                                                      12345678
