 IDENTIFICATION DIVISION.
 PROGRAM-ID. ExecSqlAdjacent.

 PROCEDURE DIVISION.

   EXEC SQL SELECT A INTO :X FROM T END-EXEC
   EXEC SQL UPDATE T SET A = 1 END-EXEC
   EXEC SQL DELETE FROM T END-EXEC.
