 IDENTIFICATION DIVISION.
 PROGRAM-ID. DfhRespEvaluate.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
   01 WS-STATUS PIC X(2).
 PROCEDURE DIVISION.
   EVALUATE EIBRESP
     WHEN DFHRESP(NORMAL)
       MOVE 'OK' TO WS-STATUS
     WHEN DFHRESP(NOTFND)
       MOVE 'NF' TO WS-STATUS
     WHEN OTHER
       MOVE 'ER' TO WS-STATUS
   END-EVALUATE.
