 IDENTIFICATION DIVISION.
 PROGRAM-ID. MOVECOMMASTMT.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SOMEFLAGONE PIC X.
 01 SOMEFLAGTWO PIC X.
 01 SOMEFLAGTHREE PIC X.
 PROCEDURE DIVISION.
    MOVE 'Y' TO SOMEFLAGONE,SOMEFLAGTWO,SOMEFLAGTHREE.
    MOVE 'N' TO SOMEFLAGONE, SOMEFLAGTWO.
    MOVE 'N' TO SOMEFLAGONE SOMEFLAGTWO.
