 IDENTIFICATION DIVISION.
 PROGRAM-ID. FileDescriptionEntryRecordNoiseWords.
 DATA DIVISION.
    FILE SECTION.
    FD FILEONE.
    LABEL RECORDS IS STANDARD
    DATA RECORDS IS SOMEDATANAME1.
    01 FILEONE-REC.
    FD FILETWO.
    LABEL RECORD ARE STANDARD
    DATA RECORD ARE SOMEDATANAME2 SOMEDATANAME3.
    01 FILETWO-REC.
    FD FILETHREE.
    LABEL RECORDS IS OMITTED.
    01 FILETHREE-REC.
    FD FILEFOUR.
    LABEL RECORD IS OMITTED.
    01 FILEFOUR-REC.
    FD FILEFIVE.
    LABEL RECORDS STANDARD.
    01 FILEFIVE-REC.
