 IDENTIFICATION DIVISION.
 PROGRAM-ID. ExecCicsAdjacent.

 PROCEDURE DIVISION.

   EXEC CICS SEND MAP('M') MAPSET('S') END-EXEC
   EXEC CICS RECEIVE MAP('M') MAPSET('S') END-EXEC
   EXEC CICS RETURN END-EXEC.
