 IDENTIFICATION DIVISION.
 PROGRAM-ID. ExecCicsComment.

 PROCEDURE DIVISION.
   EXEC CICS
*> send the BMS map
     SEND MAP('M') MAPSET('S') END-EXEC.
