 IDENTIFICATION DIVISION.
 PROGRAM-ID. DfhRespIf.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
   01 WS-STATUS PIC X(2).
 PROCEDURE DIVISION.
   IF EIBRESP = DFHRESP(NORMAL)
     MOVE 'OK' TO WS-STATUS
   END-IF.
